Revit 2026 API

# ElectricalSystemHotConductorSize Property

---

The size of a Hot Conductor in the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId HotConductorSize { get; }
```
```vb
Public ReadOnly Property HotConductorSize As ElementId
	Get
```
```cpp
public:
property ElementId^ HotConductorSize {
	ElementId^ get ();
}
```
```fsharp
member HotConductorSize : ElementId with get
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Each Hot Conductor has the same size in the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace